// Generated by jextract

package de.itemis.mosig.jassuan;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import jdk.incubator.foreign.*;
import static jdk.incubator.foreign.CLinker.*;
public class _CMSG_SIGNED_AND_ENVELOPED_ENCODE_INFO {

    static final MemoryLayout $struct$LAYOUT = MemoryLayout.structLayout(
        C_LONG.withName("cbSize"),
        MemoryLayout.paddingLayout(32),
        MemoryLayout.structLayout(
            C_LONG.withName("cbSize"),
            C_LONG.withName("cSigners"),
            C_POINTER.withName("rgSigners"),
            C_LONG.withName("cCertEncoded"),
            MemoryLayout.paddingLayout(32),
            C_POINTER.withName("rgCertEncoded"),
            C_LONG.withName("cCrlEncoded"),
            MemoryLayout.paddingLayout(32),
            C_POINTER.withName("rgCrlEncoded")
        ).withName("SignedInfo"),
        MemoryLayout.structLayout(
            C_LONG.withName("cbSize"),
            MemoryLayout.paddingLayout(32),
            C_LONG_LONG.withName("hCryptProv"),
            MemoryLayout.structLayout(
                C_POINTER.withName("pszObjId"),
                MemoryLayout.structLayout(
                    C_LONG.withName("cbData"),
                    MemoryLayout.paddingLayout(32),
                    C_POINTER.withName("pbData")
                ).withName("Parameters")
            ).withName("ContentEncryptionAlgorithm"),
            C_POINTER.withName("pvEncryptionAuxInfo"),
            C_LONG.withName("cRecipients"),
            MemoryLayout.paddingLayout(32),
            C_POINTER.withName("rgpRecipients")
        ).withName("EnvelopedInfo")
    ).withName("_CMSG_SIGNED_AND_ENVELOPED_ENCODE_INFO");
    public static MemoryLayout $LAYOUT() {
        return _CMSG_SIGNED_AND_ENVELOPED_ENCODE_INFO.$struct$LAYOUT;
    }
    static final VarHandle cbSize$VH = $struct$LAYOUT.varHandle(int.class, MemoryLayout.PathElement.groupElement("cbSize"));
    public static VarHandle cbSize$VH() {
        return _CMSG_SIGNED_AND_ENVELOPED_ENCODE_INFO.cbSize$VH;
    }
    public static int cbSize$get(MemorySegment seg) {
        return (int)_CMSG_SIGNED_AND_ENVELOPED_ENCODE_INFO.cbSize$VH.get(seg);
    }
    public static void cbSize$set( MemorySegment seg, int x) {
        _CMSG_SIGNED_AND_ENVELOPED_ENCODE_INFO.cbSize$VH.set(seg, x);
    }
    public static int cbSize$get(MemorySegment seg, long index) {
        return (int)_CMSG_SIGNED_AND_ENVELOPED_ENCODE_INFO.cbSize$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void cbSize$set(MemorySegment seg, long index, int x) {
        _CMSG_SIGNED_AND_ENVELOPED_ENCODE_INFO.cbSize$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static MemorySegment SignedInfo$slice(MemorySegment seg) {
        return seg.asSlice(8, 48);
    }
    public static MemorySegment EnvelopedInfo$slice(MemorySegment seg) {
        return seg.asSlice(56, 64);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocate(ResourceScope scope) { return allocate(SegmentAllocator.ofScope(scope)); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment allocateArray(int len, ResourceScope scope) {
        return allocateArray(len, SegmentAllocator.ofScope(scope));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, ResourceScope scope) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, scope); }
}


