// Generated by jextract

package de.itemis.mosig.jassuan;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import jdk.incubator.foreign.*;
import static jdk.incubator.foreign.CLinker.*;
public class _wireSAFEARRAY {

    static final MemoryLayout $struct$LAYOUT = MemoryLayout.structLayout(
        C_SHORT.withName("cDims"),
        C_SHORT.withName("fFeatures"),
        C_LONG.withName("cbElements"),
        C_LONG.withName("cLocks"),
        MemoryLayout.paddingLayout(32),
        MemoryLayout.structLayout(
            C_LONG.withName("sfType"),
            MemoryLayout.paddingLayout(32),
            MemoryLayout.unionLayout(
                MemoryLayout.structLayout(
                    C_LONG.withName("Size"),
                    MemoryLayout.paddingLayout(32),
                    C_POINTER.withName("aBstr")
                ).withName("BstrStr"),
                MemoryLayout.structLayout(
                    C_LONG.withName("Size"),
                    MemoryLayout.paddingLayout(32),
                    C_POINTER.withName("apUnknown")
                ).withName("UnknownStr"),
                MemoryLayout.structLayout(
                    C_LONG.withName("Size"),
                    MemoryLayout.paddingLayout(32),
                    C_POINTER.withName("apDispatch")
                ).withName("DispatchStr"),
                MemoryLayout.structLayout(
                    C_LONG.withName("Size"),
                    MemoryLayout.paddingLayout(32),
                    C_POINTER.withName("aVariant")
                ).withName("VariantStr"),
                MemoryLayout.structLayout(
                    C_LONG.withName("Size"),
                    MemoryLayout.paddingLayout(32),
                    C_POINTER.withName("aRecord")
                ).withName("RecordStr"),
                MemoryLayout.structLayout(
                    C_LONG.withName("Size"),
                    MemoryLayout.paddingLayout(32),
                    C_POINTER.withName("apUnknown"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("Data1"),
                        C_SHORT.withName("Data2"),
                        C_SHORT.withName("Data3"),
                        MemoryLayout.sequenceLayout(8, C_CHAR).withName("Data4")
                    ).withName("iid")
                ).withName("HaveIidStr"),
                MemoryLayout.structLayout(
                    C_LONG.withName("clSize"),
                    MemoryLayout.paddingLayout(32),
                    C_POINTER.withName("pData")
                ).withName("ByteStr"),
                MemoryLayout.structLayout(
                    C_LONG.withName("clSize"),
                    MemoryLayout.paddingLayout(32),
                    C_POINTER.withName("pData")
                ).withName("WordStr"),
                MemoryLayout.structLayout(
                    C_LONG.withName("clSize"),
                    MemoryLayout.paddingLayout(32),
                    C_POINTER.withName("pData")
                ).withName("LongStr"),
                MemoryLayout.structLayout(
                    C_LONG.withName("clSize"),
                    MemoryLayout.paddingLayout(32),
                    C_POINTER.withName("pData")
                ).withName("HyperStr")
            ).withName("u")
        ).withName("uArrayStructs"),
        MemoryLayout.sequenceLayout(1, MemoryLayout.structLayout(
            C_LONG.withName("cElements"),
            C_LONG.withName("lLbound")
        ).withName("tagSAFEARRAYBOUND")).withName("rgsabound")
    ).withName("_wireSAFEARRAY");
    public static MemoryLayout $LAYOUT() {
        return _wireSAFEARRAY.$struct$LAYOUT;
    }
    static final VarHandle cDims$VH = $struct$LAYOUT.varHandle(short.class, MemoryLayout.PathElement.groupElement("cDims"));
    public static VarHandle cDims$VH() {
        return _wireSAFEARRAY.cDims$VH;
    }
    public static short cDims$get(MemorySegment seg) {
        return (short)_wireSAFEARRAY.cDims$VH.get(seg);
    }
    public static void cDims$set( MemorySegment seg, short x) {
        _wireSAFEARRAY.cDims$VH.set(seg, x);
    }
    public static short cDims$get(MemorySegment seg, long index) {
        return (short)_wireSAFEARRAY.cDims$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void cDims$set(MemorySegment seg, long index, short x) {
        _wireSAFEARRAY.cDims$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle fFeatures$VH = $struct$LAYOUT.varHandle(short.class, MemoryLayout.PathElement.groupElement("fFeatures"));
    public static VarHandle fFeatures$VH() {
        return _wireSAFEARRAY.fFeatures$VH;
    }
    public static short fFeatures$get(MemorySegment seg) {
        return (short)_wireSAFEARRAY.fFeatures$VH.get(seg);
    }
    public static void fFeatures$set( MemorySegment seg, short x) {
        _wireSAFEARRAY.fFeatures$VH.set(seg, x);
    }
    public static short fFeatures$get(MemorySegment seg, long index) {
        return (short)_wireSAFEARRAY.fFeatures$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void fFeatures$set(MemorySegment seg, long index, short x) {
        _wireSAFEARRAY.fFeatures$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle cbElements$VH = $struct$LAYOUT.varHandle(int.class, MemoryLayout.PathElement.groupElement("cbElements"));
    public static VarHandle cbElements$VH() {
        return _wireSAFEARRAY.cbElements$VH;
    }
    public static int cbElements$get(MemorySegment seg) {
        return (int)_wireSAFEARRAY.cbElements$VH.get(seg);
    }
    public static void cbElements$set( MemorySegment seg, int x) {
        _wireSAFEARRAY.cbElements$VH.set(seg, x);
    }
    public static int cbElements$get(MemorySegment seg, long index) {
        return (int)_wireSAFEARRAY.cbElements$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void cbElements$set(MemorySegment seg, long index, int x) {
        _wireSAFEARRAY.cbElements$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle cLocks$VH = $struct$LAYOUT.varHandle(int.class, MemoryLayout.PathElement.groupElement("cLocks"));
    public static VarHandle cLocks$VH() {
        return _wireSAFEARRAY.cLocks$VH;
    }
    public static int cLocks$get(MemorySegment seg) {
        return (int)_wireSAFEARRAY.cLocks$VH.get(seg);
    }
    public static void cLocks$set( MemorySegment seg, int x) {
        _wireSAFEARRAY.cLocks$VH.set(seg, x);
    }
    public static int cLocks$get(MemorySegment seg, long index) {
        return (int)_wireSAFEARRAY.cLocks$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void cLocks$set(MemorySegment seg, long index, int x) {
        _wireSAFEARRAY.cLocks$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static MemorySegment uArrayStructs$slice(MemorySegment seg) {
        return seg.asSlice(16, 40);
    }
    public static MemorySegment rgsabound$slice(MemorySegment seg) {
        return seg.asSlice(56, 8);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocate(ResourceScope scope) { return allocate(SegmentAllocator.ofScope(scope)); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment allocateArray(int len, ResourceScope scope) {
        return allocateArray(len, SegmentAllocator.ofScope(scope));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, ResourceScope scope) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, scope); }
}


