// Generated by jextract

package de.itemis.mosig.jassuan;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import jdk.incubator.foreign.*;
import static jdk.incubator.foreign.CLinker.*;
public class _CRYPT_TIMESTAMP_INFO {

    static final MemoryLayout $struct$LAYOUT = MemoryLayout.structLayout(
        C_LONG.withName("dwVersion"),
        MemoryLayout.paddingLayout(32),
        C_POINTER.withName("pszTSAPolicyId"),
        MemoryLayout.structLayout(
            C_POINTER.withName("pszObjId"),
            MemoryLayout.structLayout(
                C_LONG.withName("cbData"),
                MemoryLayout.paddingLayout(32),
                C_POINTER.withName("pbData")
            ).withName("Parameters")
        ).withName("HashAlgorithm"),
        MemoryLayout.structLayout(
            C_LONG.withName("cbData"),
            MemoryLayout.paddingLayout(32),
            C_POINTER.withName("pbData")
        ).withName("HashedMessage"),
        MemoryLayout.structLayout(
            C_LONG.withName("cbData"),
            MemoryLayout.paddingLayout(32),
            C_POINTER.withName("pbData")
        ).withName("SerialNumber"),
        MemoryLayout.structLayout(
            C_LONG.withName("dwLowDateTime"),
            C_LONG.withName("dwHighDateTime")
        ).withName("ftTime"),
        C_POINTER.withName("pvAccuracy"),
        C_INT.withName("fOrdering"),
        MemoryLayout.paddingLayout(32),
        MemoryLayout.structLayout(
            C_LONG.withName("cbData"),
            MemoryLayout.paddingLayout(32),
            C_POINTER.withName("pbData")
        ).withName("Nonce"),
        MemoryLayout.structLayout(
            C_LONG.withName("cbData"),
            MemoryLayout.paddingLayout(32),
            C_POINTER.withName("pbData")
        ).withName("Tsa"),
        C_LONG.withName("cExtension"),
        MemoryLayout.paddingLayout(32),
        C_POINTER.withName("rgExtension")
    ).withName("_CRYPT_TIMESTAMP_INFO");
    public static MemoryLayout $LAYOUT() {
        return _CRYPT_TIMESTAMP_INFO.$struct$LAYOUT;
    }
    static final VarHandle dwVersion$VH = $struct$LAYOUT.varHandle(int.class, MemoryLayout.PathElement.groupElement("dwVersion"));
    public static VarHandle dwVersion$VH() {
        return _CRYPT_TIMESTAMP_INFO.dwVersion$VH;
    }
    public static int dwVersion$get(MemorySegment seg) {
        return (int)_CRYPT_TIMESTAMP_INFO.dwVersion$VH.get(seg);
    }
    public static void dwVersion$set( MemorySegment seg, int x) {
        _CRYPT_TIMESTAMP_INFO.dwVersion$VH.set(seg, x);
    }
    public static int dwVersion$get(MemorySegment seg, long index) {
        return (int)_CRYPT_TIMESTAMP_INFO.dwVersion$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void dwVersion$set(MemorySegment seg, long index, int x) {
        _CRYPT_TIMESTAMP_INFO.dwVersion$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle pszTSAPolicyId$VH = MemoryHandles.asAddressVarHandle($struct$LAYOUT.varHandle(long.class, MemoryLayout.PathElement.groupElement("pszTSAPolicyId")));
    public static VarHandle pszTSAPolicyId$VH() {
        return _CRYPT_TIMESTAMP_INFO.pszTSAPolicyId$VH;
    }
    public static MemoryAddress pszTSAPolicyId$get(MemorySegment seg) {
        return (jdk.incubator.foreign.MemoryAddress)_CRYPT_TIMESTAMP_INFO.pszTSAPolicyId$VH.get(seg);
    }
    public static void pszTSAPolicyId$set( MemorySegment seg, MemoryAddress x) {
        _CRYPT_TIMESTAMP_INFO.pszTSAPolicyId$VH.set(seg, x);
    }
    public static MemoryAddress pszTSAPolicyId$get(MemorySegment seg, long index) {
        return (jdk.incubator.foreign.MemoryAddress)_CRYPT_TIMESTAMP_INFO.pszTSAPolicyId$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void pszTSAPolicyId$set(MemorySegment seg, long index, MemoryAddress x) {
        _CRYPT_TIMESTAMP_INFO.pszTSAPolicyId$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static MemorySegment HashAlgorithm$slice(MemorySegment seg) {
        return seg.asSlice(16, 24);
    }
    public static MemorySegment HashedMessage$slice(MemorySegment seg) {
        return seg.asSlice(40, 16);
    }
    public static MemorySegment SerialNumber$slice(MemorySegment seg) {
        return seg.asSlice(56, 16);
    }
    public static MemorySegment ftTime$slice(MemorySegment seg) {
        return seg.asSlice(72, 8);
    }
    static final VarHandle pvAccuracy$VH = MemoryHandles.asAddressVarHandle($struct$LAYOUT.varHandle(long.class, MemoryLayout.PathElement.groupElement("pvAccuracy")));
    public static VarHandle pvAccuracy$VH() {
        return _CRYPT_TIMESTAMP_INFO.pvAccuracy$VH;
    }
    public static MemoryAddress pvAccuracy$get(MemorySegment seg) {
        return (jdk.incubator.foreign.MemoryAddress)_CRYPT_TIMESTAMP_INFO.pvAccuracy$VH.get(seg);
    }
    public static void pvAccuracy$set( MemorySegment seg, MemoryAddress x) {
        _CRYPT_TIMESTAMP_INFO.pvAccuracy$VH.set(seg, x);
    }
    public static MemoryAddress pvAccuracy$get(MemorySegment seg, long index) {
        return (jdk.incubator.foreign.MemoryAddress)_CRYPT_TIMESTAMP_INFO.pvAccuracy$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void pvAccuracy$set(MemorySegment seg, long index, MemoryAddress x) {
        _CRYPT_TIMESTAMP_INFO.pvAccuracy$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle fOrdering$VH = $struct$LAYOUT.varHandle(int.class, MemoryLayout.PathElement.groupElement("fOrdering"));
    public static VarHandle fOrdering$VH() {
        return _CRYPT_TIMESTAMP_INFO.fOrdering$VH;
    }
    public static int fOrdering$get(MemorySegment seg) {
        return (int)_CRYPT_TIMESTAMP_INFO.fOrdering$VH.get(seg);
    }
    public static void fOrdering$set( MemorySegment seg, int x) {
        _CRYPT_TIMESTAMP_INFO.fOrdering$VH.set(seg, x);
    }
    public static int fOrdering$get(MemorySegment seg, long index) {
        return (int)_CRYPT_TIMESTAMP_INFO.fOrdering$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void fOrdering$set(MemorySegment seg, long index, int x) {
        _CRYPT_TIMESTAMP_INFO.fOrdering$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static MemorySegment Nonce$slice(MemorySegment seg) {
        return seg.asSlice(96, 16);
    }
    public static MemorySegment Tsa$slice(MemorySegment seg) {
        return seg.asSlice(112, 16);
    }
    static final VarHandle cExtension$VH = $struct$LAYOUT.varHandle(int.class, MemoryLayout.PathElement.groupElement("cExtension"));
    public static VarHandle cExtension$VH() {
        return _CRYPT_TIMESTAMP_INFO.cExtension$VH;
    }
    public static int cExtension$get(MemorySegment seg) {
        return (int)_CRYPT_TIMESTAMP_INFO.cExtension$VH.get(seg);
    }
    public static void cExtension$set( MemorySegment seg, int x) {
        _CRYPT_TIMESTAMP_INFO.cExtension$VH.set(seg, x);
    }
    public static int cExtension$get(MemorySegment seg, long index) {
        return (int)_CRYPT_TIMESTAMP_INFO.cExtension$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void cExtension$set(MemorySegment seg, long index, int x) {
        _CRYPT_TIMESTAMP_INFO.cExtension$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle rgExtension$VH = MemoryHandles.asAddressVarHandle($struct$LAYOUT.varHandle(long.class, MemoryLayout.PathElement.groupElement("rgExtension")));
    public static VarHandle rgExtension$VH() {
        return _CRYPT_TIMESTAMP_INFO.rgExtension$VH;
    }
    public static MemoryAddress rgExtension$get(MemorySegment seg) {
        return (jdk.incubator.foreign.MemoryAddress)_CRYPT_TIMESTAMP_INFO.rgExtension$VH.get(seg);
    }
    public static void rgExtension$set( MemorySegment seg, MemoryAddress x) {
        _CRYPT_TIMESTAMP_INFO.rgExtension$VH.set(seg, x);
    }
    public static MemoryAddress rgExtension$get(MemorySegment seg, long index) {
        return (jdk.incubator.foreign.MemoryAddress)_CRYPT_TIMESTAMP_INFO.rgExtension$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void rgExtension$set(MemorySegment seg, long index, MemoryAddress x) {
        _CRYPT_TIMESTAMP_INFO.rgExtension$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocate(ResourceScope scope) { return allocate(SegmentAllocator.ofScope(scope)); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment allocateArray(int len, ResourceScope scope) {
        return allocateArray(len, SegmentAllocator.ofScope(scope));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, ResourceScope scope) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, scope); }
}


