// Generated by jextract

package de.itemis.mosig.jassuan;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import jdk.incubator.foreign.*;
import static jdk.incubator.foreign.CLinker.*;
public class tagPROPVARIANT {

    static final MemoryLayout $struct$LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                C_SHORT.withName("vt"),
                C_SHORT.withName("wReserved1"),
                C_SHORT.withName("wReserved2"),
                C_SHORT.withName("wReserved3"),
                MemoryLayout.unionLayout(
                    C_CHAR.withName("cVal"),
                    C_CHAR.withName("bVal"),
                    C_SHORT.withName("iVal"),
                    C_SHORT.withName("uiVal"),
                    C_LONG.withName("lVal"),
                    C_LONG.withName("ulVal"),
                    C_INT.withName("intVal"),
                    C_INT.withName("uintVal"),
                    MemoryLayout.unionLayout(
                        MemoryLayout.structLayout(
                            C_LONG.withName("LowPart"),
                            C_LONG.withName("HighPart")
                        ).withName("$anon$0"),
                        MemoryLayout.structLayout(
                            C_LONG.withName("LowPart"),
                            C_LONG.withName("HighPart")
                        ).withName("u"),
                        C_LONG_LONG.withName("QuadPart")
                    ).withName("hVal"),
                    MemoryLayout.unionLayout(
                        MemoryLayout.structLayout(
                            C_LONG.withName("LowPart"),
                            C_LONG.withName("HighPart")
                        ).withName("$anon$0"),
                        MemoryLayout.structLayout(
                            C_LONG.withName("LowPart"),
                            C_LONG.withName("HighPart")
                        ).withName("u"),
                        C_LONG_LONG.withName("QuadPart")
                    ).withName("uhVal"),
                    C_FLOAT.withName("fltVal"),
                    C_DOUBLE.withName("dblVal"),
                    C_SHORT.withName("boolVal"),
                    C_LONG.withName("scode"),
                    MemoryLayout.unionLayout(
                        MemoryLayout.structLayout(
                            C_LONG.withName("Lo"),
                            C_LONG.withName("Hi")
                        ).withName("$anon$0"),
                        C_LONG_LONG.withName("int64")
                    ).withName("cyVal"),
                    C_DOUBLE.withName("date"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("dwLowDateTime"),
                        C_LONG.withName("dwHighDateTime")
                    ).withName("filetime"),
                    C_POINTER.withName("puuid"),
                    C_POINTER.withName("pclipdata"),
                    C_POINTER.withName("bstrVal"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cbSize"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pData")
                    ).withName("bstrblobVal"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cbSize"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pBlobData")
                    ).withName("blob"),
                    C_POINTER.withName("pszVal"),
                    C_POINTER.withName("pwszVal"),
                    C_POINTER.withName("punkVal"),
                    C_POINTER.withName("pdispVal"),
                    C_POINTER.withName("pStream"),
                    C_POINTER.withName("pStorage"),
                    C_POINTER.withName("pVersionedStream"),
                    C_POINTER.withName("parray"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cac"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("caub"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cai"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("caui"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cal"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("caul"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cah"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cauh"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("caflt"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cadbl"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cabool"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cascode"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cacy"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cadate"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cafiletime"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cauuid"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("caclipdata"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cabstr"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("cabstrblob"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("calpstr"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("calpwstr"),
                    MemoryLayout.structLayout(
                        C_LONG.withName("cElems"),
                        MemoryLayout.paddingLayout(32),
                        C_POINTER.withName("pElems")
                    ).withName("capropvar"),
                    C_POINTER.withName("pcVal"),
                    C_POINTER.withName("pbVal"),
                    C_POINTER.withName("piVal"),
                    C_POINTER.withName("puiVal"),
                    C_POINTER.withName("plVal"),
                    C_POINTER.withName("pulVal"),
                    C_POINTER.withName("pintVal"),
                    C_POINTER.withName("puintVal"),
                    C_POINTER.withName("pfltVal"),
                    C_POINTER.withName("pdblVal"),
                    C_POINTER.withName("pboolVal"),
                    C_POINTER.withName("pdecVal"),
                    C_POINTER.withName("pscode"),
                    C_POINTER.withName("pcyVal"),
                    C_POINTER.withName("pdate"),
                    C_POINTER.withName("pbstrVal"),
                    C_POINTER.withName("ppunkVal"),
